{
  "profile": {
    "photo": "assets/images/me.PNG",
    "name": {
      "ru": "Артем Крюков",
      "en": "Artem Kriukov"
    },
    "role": {
      "ru": "iOS Developer",
      "en": "iOS Developer"
    },
    "description": {
      "ru": [
        "Я Junior iOS-разработчик, который всерьёз увлёкся Swift и созданием удобных приложений на UIKit. Люблю разбираться в сложных задачах и не боюсь багов: если они не уходят по-хорошему, подключаю логику, принты и немного детективного чутья. Учусь, чтобы делать приложения, которыми хочется гордиться. Открыт к новым знаниям и командам, ценю честную обратную связь и всегда готов брать на себя ответственность за результат."
      ],
      "en": [
        "I'm a Junior iOS developer passionate about Swift and creating user-friendly apps with UIKit. I enjoy tackling complex challenges and never shy away from bugs: if they don't leave peacefully, I bring in logic, prints, and a bit of detective flair. I'm learning to build apps I can be proud of. Open to new knowledge and teams, I value honest feedback and am always ready to take responsibility for results."
      ]
    },
    "socialLinks": [
      {
        "name": { "ru": "LinkedIn", "en": "LinkedIn" },
        "url": "https://www.linkedin.com/in/artem-kriukov-348430256/",
        "icon": "<svg xmlns='http://www.w3.org/2000/svg' width='24' height='24' viewBox='0 0 24 24' fill='currentColor'><path d='M19 0h-14c-2.761 0-5 2.239-5 5v14c0 2.761 2.239 5 5 5h14c2.762 0 5-2.239 5-5v-14c0-2.761-2.238-5-5-5zm-11 19h-3v-11h3v11zm-1.5-12.268c-.966 0-1.75-.79-1.75-1.764s.784-1.764 1.75-1.764 1.75.79 1.75 1.764-.783 1.764-1.75 1.764zm13.5 12.268h-3v-5.604c0-3.368-4-3.113-4 0v5.604h-3v-11h3v1.765c1.396-2.586 7-2.777 7 2.476v6.759z'/></svg>"
      },
      {
        "name": { "ru": "Telegram", "en": "Telegram" },
        "url": "https://t.me/artem_kriukov",
        "icon": "<svg xmlns='http://www.w3.org/2000/svg' width='24' height='24' viewBox='0 0 24 24' fill='currentColor'><path d='M12 0c-6.627 0-12 5.373-12 12s5.373 12 12 12 12-5.373 12-12-5.373-12-12-12zm5.894 8.221l-1.97 9.28c-.145.658-.537.818-1.084.508l-3-2.21-1.446 1.394c-.14.18-.357.295-.6.295-.002 0-.003 0-.005 0l.213-3.054 5.56-5.022c.24-.213-.054-.334-.373-.121l-6.869 4.326-2.96-.924c-.64-.203-.658-.64.135-.954l11.566-4.458c.538-.196 1.006.128.832.941z'/></svg>"
      },
      {
        "name": { "ru": "GitHub", "en": "GitHub" },
        "url": "https://github.com/artkriukov",
        "icon": "<svg xmlns='http://www.w3.org/2000/svg' width='24' height='24' viewBox='0 0 24 24' fill='currentColor'><path d='M12 0c-6.626 0-12 5.373-12 12 0 5.302 3.438 9.8 8.207 11.387.599.111.793-.261.793-.577v-2.234c-3.338.726-4.033-1.416-4.033-1.416-.546-1.387-1.333-1.756-1.333-1.756-1.089-.745.083-.729.083-.729 1.205.084 1.839 1.237 1.839 1.237 1.07 1.834 2.807 1.304 3.492.997.107-.775.418-1.305.762-1.604-2.665-.305-5.467-1.334-5.467-5.931 0-1.311.469-2.381 1.236-3.221-.124-.303-.535-1.524.117-3.176 0 0 1.008-.322 3.301 1.23.957-.266 1.983-.399 3.003-.404 1.02.005 2.047.138 3.006.404 2.291-1.552 3.297-1.23 3.297-1.23.653 1.653.242 2.874.118 3.176.77.84 1.235 1.911 1.235 3.221 0 4.609-2.807 5.624-5.479 5.921.43.372.823 1.102.823 2.222v3.293c0 .319.192.694.801.576 4.765-1.589 8.199-6.086 8.199-11.386 0-6.627-5.373-12-12-12z'/></svg>"
      },
      {
        "name": { "ru": "Email", "en": "Email" },
        "url": "mailto:art.kriukov@gmail.com",
        "icon": "<svg xmlns='http://www.w3.org/2000/svg' width='24' height='24' viewBox='0 0 24 24' fill='currentColor'><path d='M12 12.713l-11.985-9.713h23.97l-11.985 9.713zm0 2.574l-12-9.725v15.438h24v-15.438l-12 9.725z'/></svg>"
      }
    ]
  },
  "experiences": [
  {
    "company": "Swift Marathon 14",
    "position": { "ru": "iOS Developer", "en": "iOS Developer" },
    "period": "01-2025 - Present",
    "description": {
      "ru": "Получил ценный опыт в командной разработке iOS-приложений в условиях, максимально приближённых к реальной работе в IT-компании. В каждом проекте отвечал за полный цикл создания отдельного экрана: от проектирования интерфейса и выбора архитектуры до реализации бизнес-логики и оптимизации кода. Активно участвовал в коллективном обсуждении технических решений, обмене опытом и совместном поиске оптимальных подходов. Развил навыки эффективного взаимодействия в команде и решения сложных задач в сжатые сроки.",
      "en": "Gained valuable experience in collaborative iOS app development, closely mirroring real-world IT company workflows. In each project, was responsible for the full development cycle of a specific screen—from UI and architecture design to implementing business logic and code optimization. Actively contributed to technical discussions, shared expertise, and participated in finding optimal solutions as a team. Enhanced skills in effective team collaboration and solving complex tasks under tight deadlines."
    },
    "tasks": {
      "ru": [
        "Разработка и внедрение пользовательских интерфейсов и бизнес-логики с использованием современных архитектур (VIPER, MVC).",
        "Полная ответственность за реализацию отдельных экранов в командных проектах.",
        "Внедрение анимаций и звуковых эффектов для повышения вовлечённости пользователей.",
        "Участие в технических обсуждениях и совместной выработке архитектурных решений.",
        "Проведение код-ревью и поддержка высокого качества кода в команде.",
        "Оптимизация производительности и обеспечение стабильной работы приложений."
      ],
      "en": [
        "Developed and implemented user interfaces and business logic using modern architectures (VIPER, MVC).",
        "Took full responsibility for developing specific screens in team projects.",
        "Integrated animations and sound effects to enhance user engagement.",
        "Participated in technical discussions and collaborative architectural decision-making.",
        "Conducted code reviews and maintained high code quality within the team.",
        "Optimized performance and ensured application stability."
      ]
    }
  }
],
  "projects": [
    {
      "id": "moviequiz",
      "title": { "ru": "MovieQuiz", "en": "MovieQuiz" },
      "category": "personal",
      "image": "assets/projects/MovieQuiz.png",
      "stack": ["Storyboard", "MVP", "URLSession", "UserDefoults", "Unit-tests", "UI-tests"],
      "details": {
        "description": {
          "ru": "Одностраничное приложение с квизами о фильмах из топ-250 рейтинга и самых популярных фильмов IMDb.",
          "en": "A single-page application with quizzes about movies from the IMDb Top 250 and Most Popular Movies ratings."
        },
        "tasks": {
          "ru": [
            "Использовал NetworkClient для загрузки данных о фильмах.",
            "Реализовал MoviesLoader для загрузки списка популярных фильмов.",
            "Создал QuestionFactory для формирования вопросов на основе рейтинга фильмов.",
            "Разработал экран викторины с использованием Storyboard.",
            "Реализовал MovieQuizPresenter для управления логикой викторины.",
            "Интегрировал StatisticService для отслеживания прогресса пользователя.",
            "Реализовал обработку ошибок сети и отображение сообщений пользователю.",
            "Написал Unit-тесты и UI-тесты."
          ],
          "en": [
            "Used NetworkClient to load movie data.",
            "Implemented MoviesLoader to load the list of popular movies.",
            "Created QuestionFactory to generate questions based on movie ratings.",
            "Developed a quiz screen using Storyboard.",
            "Implemented MovieQuizPresenter to manage quiz logic.",
            "Integrated StatisticService to track user progress.",
            "Implemented network error handling and user message display.",
            "Wrote Unit tests and UI tests."
          ]
        },
        "github": "https://github.com/artkriukov/MovieQuiz",
        "videoUrl": "assets/video/quiz.mp4"
      }
    },
    {
      "id": "shopee",
      "title": { "ru": "Shoppe", "en": "Shoppe" },
      "category": "team",
      "image": "assets/projects/Shoppe.jpg",
      "stack": ["UIKit", "VIPER", "StorageManager"],
      "details": {
        "description": {
          "ru": "Shoppe – это универсальное мобильное приложение для онлайн-шопинга, которое делает покупки проще, удобнее и доступнее. Находите нужные товары, сохраняйте избранное, оформляйте заказы в разных валютах и получайте товары с доставкой по всему миру!",
          "en": "Shoppe is a universal mobile app for online shopping that makes purchasing easier, more convenient, and more accessible. Find the products you need, save favorites, place orders in different currencies, and get worldwide delivery!"
        },
        "tasks": {
          "ru": [
            "Разработал экран корзины с использованием архитектуры VIPER.",
            "Реализовал взаимодействие с данными корзины, включая добавление, удаление и изменение количества товаров.",
            "Обеспечил подсчет общей суммы и количества товаров.",
            "Работал со StorageManager для загрузки и обновления данных.",
            "Участвовал в оптимизации и рефакторинге кода для улучшения производительности и читаемости."
          ],
          "en": [
            "Developed the shopping cart screen using VIPER architecture.",
            "Implemented cart data interaction, including adding, removing, and updating product quantities.",
            "Ensured calculation of the total price and item count.",
            "Worked with StorageManager to load and update data.",
            "Participated in code optimization and refactoring to improve performance and readability."
          ]
        },
        "github": "https://github.com/artkriukov/Shoppe"
      }
    },
    {
      "id": "bomb",
      "title": { "ru": "Bomb", "en": "Bomb" },
      "category": "team",
      "image": "assets/projects/GameBomb.gif",
      "stack": ["UIKit", "MVC", "Lottie"],
      "details": {
        "description": {
          "ru": "Бомба — это iOS-приложение, которое идеально подойдет для веселых вечеринок! Игроки по очереди отвечают на вопросы, а если не успели — бомба взрывается.",
          "en": "Bomba is an iOS app perfect for fun parties! Players take turns answering questions—if they don’t answer in time, the bomb explodes."
        },
        "tasks": {
          "ru": [
            "Создал динамичные анимации с помощью библиотеки Lottie, включая анимацию тиканья бомбы и взрыва.",
            "Интегрировал звуковые эффекты: зацикленное тиканье бомбы и фоновую музыку.",
            "Реализовал интерактивный таймер с функциями паузы и возобновления.",
            "Реализовал переход на следующий экран по завершении таймера."
          ],
          "en": [
            "Created dynamic animations using the Lottie library, including bomb ticking and explosion effects.",
            "Integrated sound effects: looping bomb ticking and background music.",
            "Implemented an interactive timer with pause and resume functionality.",
            "Added a screen transition when the timer runs out."
          ]
        },
        "github": "https://github.com/artkriukov/Boom",
        "videoUrl": "assets/video/bombGame.mp4"
      }
    },
    {
      "id": "unsplash-app",
      "title": { "ru": "ImageFeed", "en": "ImageFeed" },
      "category": "personal",
      "image": "assets/projects/imagefeed.png",
      "stack": ["UIKit", "OAuth 2.0", "REST API", "UserDefaults", "Unit-tests"],
      "details": {
        "description": {
          "ru": "Многостраничное приложение для просмотра и взаимодействия с изображениями из Unsplash API с поддержкой авторизации, избранного и возможностью делиться контентом.",
          "en": "Multi-screen application for viewing and interacting with images from Unsplash API, featuring authorization, favorites, and content sharing capabilities."
        },
        "tasks": {
          "ru": [
            "Реализовал OAuth 2.0 авторизацию через Unsplash API с обработкой токенов и сохранением сессии.",
            "Разработал бесконечную ленту изображений с использованием UITableView и кастомных ячеек.",
            "Интегрировал REST API Unsplash для загрузки изображений с пагинацией и кэшированием.",
            "Создал систему добавления/удаления изображений в избранное с синхронизацией между экранами.",
            "Реализовал экран полноэкранного просмотра с поддержкой жестов (зум, поворот) и возможностью поделиться.",
            "Разработал профиль пользователя с отображением данных из Unsplash и списком избранных изображений.",
            "Настроил обработку ошибок сети с показом системных алертов и состояний placeholder.",
            "Оптимизировал загрузку изображений с прогрессивным отображением и системным индикатором загрузки.",
            "Реализовал Unit-тесты для критических модулей приложения."
          ],
          "en": [
            "Implemented OAuth 2.0 authorization via Unsplash API with token handling and session persistence.",
            "Developed an infinite image feed using UITableView with custom cells.",
            "Integrated Unsplash REST API for image loading with pagination and caching.",
            "Created a favorites system with synchronization across different screens.",
            "Built a full-screen image viewer with gesture support (zoom, rotate) and sharing functionality.",
            "Designed user profile screen displaying data from Unsplash and favorite images list.",
            "Configured network error handling with system alerts and placeholder states.",
            "Optimized image loading with progressive display and system loading indicators.",
            "Implemented Unit tests for critical application modules."
          ]
        },
        "github": "https://github.com/artkriukov/ImageFeed",
        "videoUrl": "assets/video/imagefeed.mp4"
      }
    },
    {
      "id": "trackerapp",
      "title": {
        "ru": "Habit Tracker",
        "en": "Habit Tracker"
      },
      "category": "personal",
      "image": "assets/projects/trackers.png",
      "stack": [
        "UIKit (Code-Only)",
        "Core Data",
        "SPM",
        "Localization",
        "AppMetrica",
        "Snapshot-tests"
      ],
      "details": {
        "description": {
          "ru": "Приложение для iOS, помогающее пользователям формировать и отслеживать полезные привычки. Позволяет создавать настраиваемые трекеры, просматривать прогресс и анализировать статистику.",
          "en": "An iOS application that helps users build and track useful habits. It allows creating customizable trackers, viewing progress, and analyzing statistics."
        },
        "tasks": {
          "ru": [
            "Реализовал полный CRUD-функционал для трекеров и категорий с использованием Core Data.",
            "Создал кастомный UI для карточек трекеров, календаря и экрана статистики с градиентной рамкой.",
            "Реализовал онбординг для новых пользователей.",
            "Добавил фильтрацию трекеров (по дате, завершенности, поиску) и возможность закрепления важных привычек.",
            "Внедрил поддержку тёмной темы и локализацию (русский/английский).",
            "Настроил сбор и отправку аналитических событий с помощью AppMetrica.",
            "Написал UI-тесты с использованием Snapshot-тестирования для обеспечения консистентности интерфейса."
          ],
          "en": [
            "Implemented full CRUD functionality for trackers and categories using Core Data.",
            "Created custom UI for tracker cards, a calendar, and a statistics screen with a gradient border.",
            "Implemented an onboarding flow for new users.",
            "Added tracker filtering (by date, completion status, search) and the ability to pin important habits.",
            "Integrated support for Dark Mode and localization (Russian/English).",
            "Configured the collection and sending of analytics events using AppMetrica.",
            "Wrote UI tests using Snapshot Testing to ensure interface consistency."
          ]
        },
        "github": "https://github.com/artkriukov/TrackerApp",
        "videoUrl": "assets/video/tracker.mp4"
      }
    }
  ],
"stack": [
  {
    "category": { "ru": "Языки программирования", "en": "Programming Languages" },
    "items": [
      { "icon": "assets/icons/swift.svg", "name": "Swift" },
      { "icon": "assets/icons/js.png", "name": "JavaScript" }
    ]
  },
  {
    "category": { "ru": "Фреймворки и SDK", "en": "Frameworks & SDKs" },
    "items": [
      { "icon": "assets/icons/UIKit.svg", "name": "UIKit" },
      { "icon": "assets/icons/snapkit.jpg", "name": "SnapKit" }
    ]
  },
  {
    "category": { "ru": "Архитектуры", "en": "Architecture" },
    "items": [
      { "icon": "", "name": "MVC" },
      { "icon": "", "name": "MVP" },
      { "icon": "", "name": "VIPER" },
      { "icon": "", "name": "Coordinator" }
    ]
  },
  {
    "category": { "ru": "Хранение данных", "en": "Data Storage" },
    "items": [
      { "icon": "", "name": "UserDefaults" },
      { "icon": "", "name": "FileManager" },
      { "icon": "", "name": "CoreData" },
      { "icon": "assets/icons/firabase.png", "name": "Firebase" }
    ]
  },
  {
    "category": { "ru": "Тестирование", "en": "Testing" },
    "items": [
      { "icon": "assets/icons/xctest.webp", "name": "Unit Tests" },
      { "icon": "", "name": "Snapshot Tests" },
      { "icon": "", "name": "UI Tests" }
    ]
  },
  {
    "category": { "ru": "Инструменты и CI", "en": "Tools & CI" },
    "items": [
      { "icon": "assets/icons/xcode.png", "name": "Xcode" },
      { "icon": "assets/icons/git.svg", "name": "Git" },
      { "icon": "assets/icons/git.svg", "name": "GitHub" },
      { "icon": "assets/icons/spm.png", "name": "SPM" },
      { "icon": "", "name": "SwiftLint" },
      { "icon": "", "name": "XcodeGen" }
    ]
  },
  {
    "category": { "ru": "UI/UX и взаимодействие", "en": "UI/UX & Collaboration" },
    "items": [
      { "icon": "assets/icons/figma.png", "name": "Figma" },
      { "icon": "assets/icons/postman.svg", "name": "Postman" }
    ]
  },
  {
    "category": { "ru": "Принципы и подходы", "en": "Principles" },
    "items": [
      { "icon": "", "name": "SOLID" },
      { "icon": "", "name": "DRY" },
      { "icon": "", "name": "KISS" },
      { "icon": "", "name": "YAGNI" },
      { "icon": "", "name": "Refactoring" }
    ]
  }
]
}
