{
  "ru": {
    "projects": [
      {
        "id": "moviequiz",
        "title": "MovieQuiz",
        "category": "personal",
        "image": "assets/projects/MovieQuiz.png",
        "stack": ["Storyboard", "MVP", "URLSession", "UserDefoults", "Unit-tests", "UI-tests"],
        "details": {
          "description": "Одностраничное приложение с квизами о фильмах из топ-250 рейтинга и самых популярных фильмов IMDb.",
          "tasks": [
            "Использовал NetworkClient для загрузки данных о фильмах.",
            "Реализовал MoviesLoader для загрузки списка популярных фильмов.",
            "Создал QuestionFactory для формирования вопросов на основе рейтинга фильмов.",
            "Разработал экран викторины с использованием Storyboard.",
            "Реализовал MovieQuizPresenter для управления логикой викторины.",
            "Интегрировал StatisticService для отслеживания прогресса пользователя.",
            "Реализовал обработку ошибок сети и отображение сообщений пользователю.",
            "Написал Unit-тесты и UI-тесты."
          ],
          "github": "https://github.com/artkriukov/MovieQuiz",
          "videoUrl": "assets/video/quiz.mp4"
        }
      },
      {
        "id": "shopee",
        "title": "Shoppe",
        "category": "team",
        "image": "assets/projects/Shoppe.jpg",
        "stack": ["UIKit", "VIPER", "StorageManager"],
        "details": {
          "description": "Shoppe – это универсальное мобильное приложение для онлайн-шопинга, которое делает покупки проще, удобнее и доступнее. Находите нужные товары, сохраняйте избранное, оформляйте заказы в разных валютах и получайте товары с доставкой по всему миру!",
          "tasks": [
            "Разработал экран корзины с использованием архитектуры VIPER.",
            "Реализовал взаимодействие с данными корзины, включая добавление, удаление и изменение количества товаров.",
            "Обеспечил подсчет общей суммы и количества товаров.",
            "Работал со StorageManager для загрузки и обновления данных.",
            "Участвовал в оптимизации и рефакторинге кода для улучшения производительности и читаемости."
          ],
          "github": "https://github.com/artkriukov/Shoppe"
        }
      },
      {
        "id": "bomb",
        "title": "Bomb",
        "category": "team",
        "image": "assets/projects/GameBomb.gif",
        "stack": ["UIKit", "MVC", "Lottie"],
        "details": {
          "description": "Бомба — это iOS-приложение, которое идеально подойдет для веселых вечеринок! Игроки по очереди отвечают на вопросы, а если не успели — бомба взрывается.",
          "tasks": [
            "Создал динамичные анимации с помощью библиотеки Lottie, включая анимацию тиканья бомбы и взрыва.",
            "Интегрировал звуковые эффекты: зацикленное тиканье бомбы и фоновую музыку.",
            "Реализовал интерактивный таймер с функциями паузы и возобновления.",
            "Реализовал переход на следующий экран по завершении таймера."
          ],
          "github": "https://github.com/artkriukov/Boom",
          "videoUrl": "assets/video/bombGame.mp4"
        }
      },
      {
        "id": "unsplash-app",
        "title": "ImageFeed",
        "category": "personal",
        "image": "assets/projects/unsplash-app.png",
        "stack": ["UIKit", "OAuth 2.0", "REST API", "UserDefaults", "Unit-tests"],
        "details": {
          "description": "Многостраничное приложение для просмотра и взаимодействия с изображениями из Unsplash API с поддержкой авторизации, избранного и возможностью делиться контентом.",
          "tasks": [
            "Реализовал OAuth 2.0 авторизацию через Unsplash API с обработкой токенов и сохранением сессии.",
            "Разработал бесконечную ленту изображений с использованием UITableView и кастомных ячеек.",
            "Интегрировал REST API Unsplash для загрузки изображений с пагинацией и кэшированием.",
            "Создал систему добавления/удаления изображений в избранное с синхронизацией между экранами.",
            "Реализовал экран полноэкранного просмотра с поддержкой жестов (зум, поворот) и возможностью поделиться.",
            "Разработал профиль пользователя с отображением данных из Unsplash и списком избранных изображений.",
            "Настроил обработку ошибок сети с показом системных алертов и состояний placeholder.",
            "Оптимизировал загрузку изображений с прогрессивным отображением и системным индикатором загрузки.",
            "Реализовал Unit-тесты для критических модулей приложения."
          ],
          "github": "https://github.com/artkriukov/ImageFeed",
          "videoUrl": "assets/video/imagefeed.mp4"
        }
      }
    ]
  },
  "en": {
    "projects": [
      {
        "id": "moviequiz",
        "title": "MovieQuiz",
        "category": "personal",
        "image": "assets/projects/MovieQuiz.png",
        "stack": ["Storyboard", "MVP", "URLSession", "UserDefoults", "Unit-tests", "UI-tests"],
        "details": {
          "description": "A single-page application with quizzes about movies from the IMDb Top 250 and Most Popular Movies ratings.",
          "tasks": [
            "Used NetworkClient to load movie data.",
            "Implemented MoviesLoader to load the list of popular movies.",
            "Created QuestionFactory to generate questions based on movie ratings.",
            "Developed a quiz screen using Storyboard.",
            "Implemented MovieQuizPresenter to manage quiz logic.",
            "Integrated StatisticService to track user progress.",
            "Implemented network error handling and user message display.",
            "Wrote Unit tests and UI tests."
          ],
          "github": "https://github.com/artkriukov/MovieQuiz",
          "videoUrl": "assets/video/quiz.mp4"
        }
      },
      {
        "id": "shopee",
        "title": "Shoppe",
        "category": "team",
        "image": "assets/projects/Shoppe.jpg",
        "stack": ["UIKit", "VIPER", "StorageManager"],
        "details": {
          "description": "Shoppe is a universal mobile app for online shopping that makes purchasing easier, more convenient, and more accessible. Find the products you need, save favorites, place orders in different currencies, and get worldwide delivery!",
          "tasks": [
            "Developed the shopping cart screen using VIPER architecture.",
            "Implemented cart data interaction, including adding, removing, and updating product quantities.",
            "Ensured calculation of the total price and item count.",
            "Worked with StorageManager to load and update data.",
            "Participated in code optimization and refactoring to improve performance and readability."
          ],
          "github": "https://github.com/artkriukov/Shoppe"
        }
      },
      {
        "id": "bomb",
        "title": "Bomb",
        "category": "team",
        "image": "assets/projects/GameBomb.gif",
        "stack": ["UIKit", "MVC", "Lottie"],
        "details": {
         "description": "Bomba is an iOS app perfect for fun parties! Players take turns answering questions—if they don’t answer in time, the bomb explodes.",
          "tasks": [
            "Created dynamic animations using the Lottie library, including bomb ticking and explosion effects.",
            "Integrated sound effects: looping bomb ticking and background music.",
            "Implemented an interactive timer with pause and resume functionality.",
            "Added a screen transition when the timer runs out."
          ],
          "github": "https://github.com/artkriukov/Boom",
          "videoUrl": "assets/video/bombGame.mp4"
        }
      },
      {
        "id": "unsplash-app",
        "title": "ImageFeed",
        "category": "personal",
        "image": "assets/projects/unsplash-app.png",
        "stack": ["UIKit", "OAuth 2.0", "REST API", "UserDefaults", "Unit-tests"],
        "details": {
          "description": "Multi-screen application for viewing and interacting with images from Unsplash API, featuring authorization, favorites, and content sharing capabilities.",
          "tasks": [
            "Implemented OAuth 2.0 authorization via Unsplash API with token handling and session persistence.",
            "Developed an infinite image feed using UITableView with custom cells.",
            "Integrated Unsplash REST API for image loading with pagination and caching.",
            "Created a favorites system with synchronization across different screens.",
            "Built a full-screen image viewer with gesture support (zoom, rotate) and sharing functionality.",
            "Designed user profile screen displaying data from Unsplash and favorite images list.",
            "Configured network error handling with system alerts and placeholder states.",
            "Optimized image loading with progressive display and system loading indicators.",
            "Implemented Unit tests for critical application modules."
          ],
          "github": "https://github.com/artkriukov/ImageFeed",
          "videoUrl": "assets/video/imagefeed.mp4"
        }
      }
    ]
  }
}